In [ ]:
#formating tampilan pada data frame

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [3]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

   omset  operasional
0     17            8
1     12            7
2     15            5
3     16           17
4     17           17

In [4]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1700000        80000
1  1200000        70000
2  1500000        50000
3  1600000       170000
4  1700000       170000

In [7]:
df.index = pd.util.testing.makeDateIndex (n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

C:\Users\ACER\anaconda3\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01  1700000        80000
1 2000-01-02  1200000        70000
2 2000-01-03  1500000        50000
3 2000-01-04  1600000       170000
4 2000-01-05  1700000       170000

In [ ]:
#menggunakan pd.uti;.testing.makeDateIndex berupa date time.

In [ ]:
#Formatting tampilan data frame

In [8]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [9]:
type(laporan)

pandas.io.formats.style.Styler

In [10]:
laporan.hide_index()

In [11]:
laporan.set_caption('Data Omset dan Operasional')

In [19]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightgreen')
laporan.highlight_max('operasional', color='grey')